backend/data/msr_sample.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tdpplv1="http://datex2.eu/wsdl/TDP/Soap_Datex2/Pull/v1" xmlns:dx223="http://datex2.eu/schema/2/2_0">
    <SOAP-ENV:Body>
        <dx223:d2LogicalModel xsi:type="dx223:D2LogicalModel" modelBaseVersion="2">
            <dx223:exchange xsi:type="dx223:Exchange">
                <dx223:supplierIdentification xsi:type="dx223:InternationalIdentifier">
                    <dx223:country xsi:type="dx223:CountryEnum">ch</dx223:country>
                    <dx223:nationalIdentifier xsi:type="dx223:String">OTD</dx223:nationalIdentifier>
                </dx223:supplierIdentification>
            </dx223:exchange>
            <dx223:payloadPublication xsi:type="dx223:MeasuredDataPublication" lang="en">
                <dx223:publicationTime xsi:type="dx223:DateTime">2023-11-27T15:37:18.075109Z</dx223:publicationTime>
                <dx223:publicationCreator xsi:type="dx223:InternationalIdentifier">
                    <dx223:country xsi:type="dx223:CountryEnum">ch</dx223:country>
                    <dx223:nationalIdentifier xsi:type="dx223:String">OTD</dx223:nationalIdentifier>
                </dx223:publicationCreator>
                <dx223:measurementSiteTableReference xsi:type="dx223:_MeasurementSiteTableVersionedReference" targetClass="MeasurementSiteTable" id="OTD:TrafficData" version="69"></dx223:measurementSiteTableReference>
                <dx223:headerInformation xsi:type="dx223:HeaderInformation">
                    <dx223:confidentiality xsi:type="dx223:ConfidentialityValueEnum">noRestriction</dx223:confidentiality>
                    <dx223:informationStatus xsi:type="dx223:InformationStatusEnum">real</dx223:informationStatus>
                </dx223:headerInformation>
                <dx223:siteMeasurements xsi:type="dx223:SiteMeasurements">
                    <dx223:measurementSiteReference xsi:type="dx223:_MeasurementSiteRecordVersionedReference" targetClass="MeasurementSiteRecord" id="CH:0542.05" version="1"></dx223:measurementSiteReference>
                    <dx223:measurementTimeDefault xsi:type="dx223:DateTime">2023-11-27T15:36:00.000000Z</dx223:measurementTimeDefault>
                    <dx223:measuredValue xsi:type="dx223:_SiteMeasurementsIndexMeasuredValue" index="0">
                        <dx223:measuredValue xsi:type="dx223:MeasuredValue">
                            <dx223:basicData xsi:type="dx223:TrafficFlow">
                                <dx223:vehicleFlow xsi:type="dx223:VehicleFlowValue">
                                    <dx223:dataError xsi:type="dx223:Boolean">true</dx223:dataError>
                                    <dx223:reasonForDataError xsi:type="dx223:MultilingualString">
                                        <dx223:values>
                                            <dx223:value xsi:type="dx223:MultilingualStringValue" lang="en">VD_OFFLINE</dx223:value>
                                        </dx223:values>
                                    </dx223:reasonForDataError>
                                    <dx223:vehicleFlowRate xsi:type="dx223:VehiclesPerHour">0</dx223:vehicleFlowRate>
                                </dx223:vehicleFlow>
                            </dx223:basicData>
                        </dx223:measuredValue>
                    </dx223:measuredValue>
                </dx223:siteMeasurements>
                <dx223:siteMeasurements xsi:type="dx223:SiteMeasurements">
                    <dx223:measurementSiteReference xsi:type="dx223:_MeasurementSiteRecordVersionedReference" targetClass="MeasurementSiteRecord" id="CH:0026.03" version="1"></dx223:measurementSiteReference>
                    <dx223:measurementTimeDefault xsi:type="dx223:DateTime">2023-11-27T15:36:00.000000Z</dx223:measurementTimeDefault>
                    <dx223:measuredValue xsi:type="dx223:_SiteMeasurementsIndexMeasuredValue" index="11">
                        <dx223:measuredValue xsi:type="dx223:MeasuredValue">
                            <dx223:basicData xsi:type="dx223:TrafficFlow">
                                <dx223:vehicleFlow xsi:type="dx223:VehicleFlowValue">
                                    <dx223:vehicleFlowRate xsi:type="dx223:VehiclesPerHour">1560</dx223:vehicleFlowRate>
                                </dx223:vehicleFlow>
                            </dx223:basicData>
                        </dx223:measuredValue>
                    </dx223:measuredValue>
                    <dx223:measuredValue xsi:type="dx223:_SiteMeasurementsIndexMeasuredValue" index="12">
                        <dx223:measuredValue xsi:type="dx223:MeasuredValue">
                            <dx223:basicData xsi:type="dx223:TrafficSpeed">
                                <dx223:averageVehicleSpeed xsi:type="dx223:SpeedValue" numberOfInputValuesUsed="26">
                                    <dx223:speed xsi:type="dx223:KilometresPerHour">87.9000015</dx223:speed>
                                </dx223:averageVehicleSpeed>
                            </dx223:basicData>
                        </dx223:measuredValue>
                    </dx223:measuredValue>
                    <dx223:measuredValue xsi:type="dx223:_SiteMeasurementsIndexMeasuredValue" index="21">
                        <dx223:measuredValue xsi:type="dx223:MeasuredValue">
                            <dx223:basicData xsi:type="dx223:TrafficFlow">
                                <dx223:vehicleFlow xsi:type="dx223:VehicleFlowValue">
                                    <dx223:vehicleFlowRate xsi:type="dx223:VehiclesPerHour">0</dx223:vehicleFlowRate>
                                </dx223:vehicleFlow>
                            </dx223:basicData>
                        </dx223:measuredValue>
                    </dx223:measuredValue>
                    <dx223:measuredValue xsi:type="dx223:_SiteMeasurementsIndexMeasuredValue" index="1">
                        <dx223:measuredValue xsi:type="dx223:MeasuredValue">
                            <dx223:basicData xsi:type="dx223:TrafficFlow">
                                <dx223:vehicleFlow xsi:type="dx223:VehicleFlowValue">
                                    <dx223:vehicleFlowRate xsi:type="dx223:VehiclesPerHour">0</dx223:vehicleFlowRate>
                                </dx223:vehicleFlow>
                            </dx223:basicData>
                        </dx223:measuredValue>
                    </dx223:measuredValue>
                </dx223:siteMeasurements>
                <dx223:siteMeasurements xsi:type="dx223:SiteMeasurements">
                    <dx223:measurementSiteReference xsi:type="dx223:_MeasurementSiteRecordVersionedReference" targetClass="MeasurementSiteRecord" id="CH:0301.03" version="1"></dx223:measurementSiteReference>
                    <dx223:measurementTimeDefault xsi:type="dx223:DateTime">2023-11-27T15:36:00.000000Z</dx223:measurementTimeDefault>
                    <dx223:measuredValue xsi:type="dx223:_SiteMeasurementsIndexMeasuredValue" index="11">
                        <dx223:measuredValue xsi:type="dx223:MeasuredValue">
                            <dx223:basicData xsi:type="dx223:TrafficFlow">
                                <dx223:vehicleFlow xsi:type="dx223:VehicleFlowValue">
                                    <dx223:vehicleFlowRate xsi:type="dx223:VehiclesPerHour">1200</dx223:vehicleFlowRate>
                                </dx223:vehicleFlow>
                            </dx223:basicData>
                        </dx223:measuredValue>
                    </dx223:measuredValue>
                    <dx223:measuredValue xsi:type="dx223:_SiteMeasurementsIndexMeasuredValue" index="12">
                        <dx223:measuredValue xsi:type="dx223:MeasuredValue">
                            <dx223:basicData xsi:type="dx223:TrafficSpeed">
                                <dx223:averageVehicleSpeed xsi:type="dx223:SpeedValue" numberOfInputValuesUsed="20">
                                    <dx223:speed xsi:type="dx223:KilometresPerHour">84.9000015</dx223:speed>
                                </dx223:averageVehicleSpeed>
                            </dx223:basicData>
                        </dx223:measuredValue>
                    </dx223:measuredValue>
                    <dx223:measuredValue xsi:type="dx223:_SiteMeasurementsIndexMeasuredValue" index="21">
                        <dx223:measuredValue xsi:type="dx223:MeasuredValue">
                            <dx223:basicData xsi:type="dx223:TrafficFlow">
                                <dx223:vehicleFlow xsi:type="dx223:VehicleFlowValue">
                                    <dx223:vehicleFlowRate xsi:type="dx223:VehiclesPerHour">180</dx223:vehicleFlowRate>
                                </dx223:vehicleFlow>
                            </dx223:basicData>
                        </dx223:measuredValue>
                    </dx223:measuredValue>
                    <dx223:measuredValue xsi:type="dx223:_SiteMeasurementsIndexMeasuredValue" index="22">
                        <dx223:measuredValue xsi:type="dx223:MeasuredValue">
                            <dx223:basicData xsi:type="dx223:TrafficSpeed">
                                <dx223:averageVehicleSpeed xsi:type="dx223:SpeedValue" numberOfInputValuesUsed="3">
                                    <dx223:speed xsi:type="dx223:KilometresPerHour">80</dx223:speed>
                                </dx223:averageVehicleSpeed>
                            </dx223:basicData>
                        </dx223:measuredValue>
                    </dx223:measuredValue>
                    <dx223:measuredValue xsi:type="dx223:_SiteMeasurementsIndexMeasuredValue" index="1">
                        <dx223:measuredValue xsi:type="dx223:MeasuredValue">
                            <dx223:basicData xsi:type="dx223:TrafficFlow">
                                <dx223:vehicleFlow xsi:type="dx223:VehicleFlowValue">
                                    <dx223:vehicleFlowRate xsi:type="dx223:VehiclesPerHour">0</dx223:vehicleFlowRate>
                                </dx223:vehicleFlow>
                            </dx223:basicData>
                        </dx223:measuredValue>
                    </dx223:measuredValue>
                </dx223:siteMeasurements>
             </dx223:payloadPublication>
        </dx223:d2LogicalModel>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
